mamedev/mame/src/devices/cpu/tms32025/tms32025.cpp
#if 0
// Instead of using the map here we install the ROM depending on the MP/MC pin set in the config
void tms3202x_device::tms32025_program(address_map &map)
{
	map(0x0000, 0x0fff).rom().region("internal", 0); // 4K Words Internal ROM / EPROM
}
#endif

ROM_START( tms32025 )
	ROM_REGION16_BE( 0x2000, "internal", ROMREGION_ERASE00 )
	// use blank data if internal ROM is not programmed
ROM_END

const tiny_rom_entry *tms32025_device::device_rom_region() const
{
	return ROM_NAME(tms32025);
}


tms3202x_device::tms3202x_device(
		const machine_config &mconfig,
		device_type type,
		const char *tag,
		device_t *owner,
		uint32_t clock,
		unsigned stack_depth,
		address_map_constructor prgmap,
		address_map_constructor datamap)
	: cpu_device(mconfig, type, tag, owner, clock)
	, m_program_config("program", ENDIANNESS_BIG, 16, 16, -1, prgmap)
	, m_data_config("data", ENDIANNESS_BIG, 16, 16, -1, datamap)
	, m_io_config("io", ENDIANNESS_BIG, 16, 16, -1)
	, m_b0(*this, "b0")
	, m_b1(*this, "b1")
	, m_b2(*this, "b2")
	, m_b3(*this, "b3")
	, m_bio_in(*this, 0xffff)
	, m_hold_in(*this, 0xffff)
	, m_hold_ack_out(*this)
	, m_xf_out(*this)
	, m_dr_in(*this, 0xffff)
	, m_dx_out(*this)
	, m_stack_limit(stack_depth - 1)
{
}

tms32020_device::tms32020_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms3202x_device(mconfig, TMS32020, tag, owner, clock, 4, address_map_constructor(), address_map_constructor(FUNC(tms3202x_device::tms3202x_data), this))
{
	m_fixed_STR1 = 0x0180;
}

tms32025_device::tms32025_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, address_map_constructor prgmap, address_map_constructor datamap)
	: tms3202x_device(mconfig, type, tag, owner, clock, 8, prgmap, datamap)
	, m_mp_mc(true)
{
}

tms32025_device::tms32025_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock)
	: tms32025_device(mconfig, type, tag, owner, clock, address_map_constructor(), address_map_constructor(FUNC(tms3202x_device::tms3202x_data), this))
{
	m_fixed_STR1 = 0x0180;
}

tms32025_device::tms32025_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms32025_device(mconfig, TMS32025, tag, owner, clock)
{
}

tms32026_device::tms32026_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms32025_device(mconfig, TMS32026, tag, owner, clock, address_map_constructor(), address_map_constructor(FUNC(tms32026_device::tms32026_data), this))
{
	m_fixed_STR1 = 0x0100;
}

device_memory_interface::space_config_vector tms3202x_device::memory_space_config() const
{
	return space_config_vector {
		std::make_pair(AS_PROGRAM, &m_program_config),
		std::make_pair(AS_DATA,    &m_data_config),
		std::make_pair(AS_IO,      &m_io_config)
	};
}

std::unique_ptr<util::disasm_interface> tms3202x_device::create_disassembler()
{
	return std::make_unique<tms32025_disassembler>();
}

uint16_t tms3202x_device::drr_r()
{
	return m_drr;
}

void tms3202x_device::drr_w(uint16_t data)
{
	m_drr = data;
}

uint16_t tms3202x_device::dxr_r()
{
	return m_dxr;
}

void tms3202x_device::dxr_w(uint16_t data)
{
	m_dxr = data;

	if(TXM) {
		if(FSM)
			m_waiting_for_serial_frame = true;
		else
			m_IFR |= 0x20;
	}
}

uint16_t tms3202x_device::tim_r()
{
	return m_tim;
}

void tms3202x_device::tim_w(uint16_t data)
{
	m_tim = data;
}

uint16_t tms3202x_device::prd_r()
{
	return m_prd;
}

void tms3202x_device::prd_w(uint16_t data)
{
	m_prd = data;
}

uint16_t tms3202x_device::imr_r()
{
	return m_imr;
}

void tms3202x_device::imr_w(uint16_t data)
{
	m_imr = data;
}

uint16_t tms3202x_device::greg_r()
{
	return m_greg;
}

void tms3202x_device::greg_w(uint16_t data)
{
	m_greg = data;
}


inline void tms3202x_device::CLR0(uint16_t flag) { m_STR0 &= ~flag; m_STR0 |= 0x0400; }
inline void tms3202x_device::SET0(uint16_t flag) { m_STR0 |=  flag; m_STR0 |= 0x0400; }
inline void tms3202x_device::CLR1(uint16_t flag) { m_STR1 &= ~flag; m_STR1 |= m_fixed_STR1; }
inline void tms3202x_device::SET1(uint16_t flag) { m_STR1 |=  flag; m_STR1 |= m_fixed_STR1; }

inline void tms3202x_device::MODIFY_DP(int data)
{
	m_STR0 &= ~DP_REG;
	m_STR0 |= (data & DP_REG);
	m_STR0 |= 0x0400;
}

inline void tms3202x_device::MODIFY_PM(int data)
{
	m_STR1 &= ~PM_REG;
	m_STR1 |= (data & PM_REG);
	m_STR1 |= m_fixed_STR1;
}

inline void tms3202x_device::MODIFY_ARP(int data)
{
	m_STR1 &= ~ARB_REG;
	m_STR1 |= (m_STR0 & ARP_REG);
	m_STR1 |= m_fixed_STR1;
	m_STR0 &= ~ARP_REG;
	m_STR0 |= ((data << 13) & ARP_REG);
	m_STR0 |= 0x0400;
}

inline uint16_t tms3202x_device::reverse_carry_add(uint16_t arg0, uint16_t arg1)
{
	uint16_t result = 0;
	int carry = 0;
	for (int count = 0; count < 16; count++)
	{
		int sum = (arg0 >> 15) + (arg1 >> 15) + carry;
		result = (result << 1) | (sum & 1);
		carry = sum >> 1;
		arg0 <<= 1;
		arg1 <<= 1;
	}
	return result;
}

template <bool IgnoreARPHack = false>
inline void tms3202x_device::MODIFY_AR_ARP()
{ /* modify address register referenced by ARP */
	switch (m_opcode.b.l & 0x70)        /* Cases ordered by predicted useage */
	{
		case 0x00: /* 000   nop      */
			break;

		case 0x10: /* 001   *-       */
			m_AR[ARP]--;
			break;

		case 0x20: /* 010   *+       */
			m_AR[ARP]++;
			break;

		case 0x30: /* 011   reserved */
			break;

		case 0x40: /* 100   *BR0-    */
			m_AR[ARP] = reverse_carry_add(m_AR[ARP],-m_AR[0]);
			break;

		case 0x50: /* 101   *0-      */
			m_AR[ARP] -= m_AR[0];
			break;

		case 0x60: /* 110   *0+      */
			m_AR[ARP] += m_AR[0];
			break;

		case 0x70: /* 111   *BR0+    */
			m_AR[ARP] += reverse_carry_add(m_AR[ARP],m_AR[0]);
			break;
	}

	if (!IgnoreARPHack)
	{
		if (m_opcode.b.l & 8)
		{ /* bit 3 determines if new value is loaded into ARP */
			MODIFY_ARP((m_opcode.b.l & 7) );
		}
	}
}

inline void tms3202x_device::CALCULATE_ADD_CARRY()
{
	if (uint32_t(m_oldacc.d) > uint32_t(m_ACC.d))
	{
		SET1(C_FLAG);
	}
	else
	{
		CLR1(C_FLAG);
	}
}

inline void tms3202x_device::CALCULATE_SUB_CARRY()
{
	if (uint32_t(m_oldacc.d) < uint32_t(m_ACC.d))
	{
		CLR1(C_FLAG);
	}
	else
	{
		SET1(C_FLAG);
	}
}

inline void tms3202x_device::CALCULATE_ADD_OVERFLOW(int32_t addval)
{
	if (int32_t((m_ACC.d ^ addval) & (m_oldacc.d ^ m_ACC.d)) < 0)
	{
		SET0(OV_FLAG);
		if (OVM)
		{
			m_ACC.d = (int32_t(m_oldacc.d) < 0) ? 0x80000000 : 0x7fffffff;
		}
	}
}

inline void tms3202x_device::CALCULATE_SUB_OVERFLOW(int32_t subval)
{
	if (int32_t((m_oldacc.d ^ subval) & (m_oldacc.d ^ m_ACC.d)) < 0)
	{
		SET0(OV_FLAG);
		if (OVM)
		{
			m_ACC.d = (int32_t(m_oldacc.d) < 0) ? 0x80000000 : 0x7fffffff;
		}
	}
}

inline uint16_t tms3202x_device::POP_STACK()
{
	uint16_t const data = m_STACK[m_stack_limit];
	for (unsigned i = m_stack_limit; i > 0; --i)
		m_STACK[i] = m_STACK[i - 1];
	return data;
}

