mamedev/mame/src/devices/cpu/tms32025/tms32025.cpp
inline void tms3202x_device::PUSH_STACK(uint16_t data)
{
	for (unsigned i = 0; i < m_stack_limit; ++i)
		m_STACK[i] = m_STACK[i + 1];
	m_STACK[m_stack_limit] = data;
}

inline void tms3202x_device::SHIFT_Preg_TO_ALU()
{
	switch (PM)      /* PM (in STR1) is the shift mode for Preg */
	{
		case 0:     m_ALU.d = m_Preg.d; break;
		case 1:     m_ALU.d = (m_Preg.d << 1); break;
		case 2:     m_ALU.d = (m_Preg.d << 4); break;
		case 3:     m_ALU.d = (m_Preg.d >> 6); if (m_Preg.d & 0x80000000) m_ALU.d |= 0xfc000000; break;
		default:    break;
	}
}

template <bool IgnoreARPHack = false>
inline void tms3202x_device::GETDATA()
{
	if (m_opcode.b.l & 0x80)
	{ /* indirect memory access */
		m_memaccess = IND;
	}
	else
	{ /* direct memory address */
		m_memaccess = DMA;
	}

	m_ALU.d = (uint16_t)m_data.read_word(m_memaccess);

	/* next ARP */
	if (m_opcode.b.l & 0x80) MODIFY_AR_ARP<IgnoreARPHack>();
}

inline void tms3202x_device::GETDATA(int shift, int signext)
{
	GETDATA();

	if (signext)
		m_ALU.d = (int16_t)m_ALU.d;

	m_ALU.d <<= shift;
}

inline void tms3202x_device::PUTDATA(uint16_t data)
{
	if (m_opcode.b.l & 0x80)
	{
		m_data.write_word(IND, data);
		MODIFY_AR_ARP();
	}
	else
	{
		m_data.write_word(DMA, data);
	}
}

inline void tms3202x_device::PUTDATA_SST(uint16_t data)
{
	if (m_opcode.b.l & 0x80) m_memaccess = IND;
	else m_memaccess = DMApg0;

	if (m_opcode.b.l & 0x80) {
		m_opcode.b.l &= 0xf7;                   /* Stop ARP changes */
		MODIFY_AR_ARP();
	}
	m_data.write_word(m_memaccess, data);
}



/****************************************************************************
 *  Emulate the Instructions
 ****************************************************************************/

/* The following functions are here to fill the void for the */
/* opcode call functions. These functions are never actually called. */
void tms3202x_device::opcodes_CE() { fatalerror("Should never get here!\n"); }
void tms3202x_device::opcodes_Dx() { fatalerror("Should never get here!\n"); }

void tms3202x_device::illegal()
{
	logerror("TMS3202x:  PC = %04x,  Illegal opcode = %04x\n", (m_PC-1), m_opcode.w.l);
}

void tms3202x_device::abst()
{
	if ((int32_t)m_ACC.d < 0) {
		m_ACC.d = -m_ACC.d;
		if (m_ACC.d == 0x80000000) {
			SET0(OV_FLAG);
			if (OVM) m_ACC.d--;
		}
	}
	CLR1(C_FLAG);
}
void tms3202x_device::add()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_opcode.b.h & 0xf), SXM);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::addc()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	if (CARRY) m_ACC.d++;
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	if (m_ACC.d == m_oldacc.d) {}   /* edge case, carry remains same */
	else CALCULATE_ADD_CARRY();
}
void tms3202x_device::addh()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_ACC.w.h += m_ALU.w.l;
	if ((uint16_t)m_oldacc.w.h > (uint16_t)m_ACC.w.h) {
		SET1(C_FLAG); /* Carry flag is not cleared, if no carry occurred */
	}
	if (int16_t((m_ACC.w.h ^ m_ALU.w.l) & (m_oldacc.w.h ^ m_ACC.w.h)) < 0) {
		SET0(OV_FLAG);
		if (OVM) m_ACC.w.h = ((int16_t)m_oldacc.w.h < 0) ? 0x8000 : 0x7fff;
	}
}
void tms3202x_device::addk()
{
	m_oldacc.d = m_ACC.d;
	m_ALU.d = (uint8_t)m_opcode.b.l;
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::adds()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::addt()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_Treg & 0xf), SXM);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::adlk()
{
	m_oldacc.d = m_ACC.d;
	if (SXM) m_ALU.d =  (int16_t)m_cache.read_word(m_PC);
	else     m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::adrk()
{
	m_AR[ARP] += m_opcode.b.l;
}
void tms3202x_device::and_()
{
	GETDATA();
	m_ACC.d &= m_ALU.d;
}
void tms3202x_device::andk()
{
	m_oldacc.d = m_ACC.d;
	m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d &= m_ALU.d;
}
void tms3202x_device::apac()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::br()
{
	m_PC = m_cache.read_word(m_PC);
	MODIFY_AR_ARP();
}
void tms3202x_device::bacc()
{
	m_PC = m_ACC.w.l;
}
void tms3202x_device::banz()
{
	if (m_AR[ARP]) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bbnz()
{
	if (TC) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bbz()
{
	if (TC == 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bc()
{
	if (CARRY) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bgez()
{
	if ((int32_t)m_ACC.d >= 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bgz()
{
	if ((int32_t)m_ACC.d > 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bioz()
{
	if (m_bio_in() != CLEAR_LINE) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bit()
{
	GETDATA();
	if (m_ALU.d & (0x8000 >> (m_opcode.b.h & 0xf))) SET1(TC_FLAG);
	else CLR1(TC_FLAG);
}
void tms3202x_device::bitt()
{
	GETDATA();
	if (m_ALU.d & (0x8000 >> (m_Treg & 0xf))) SET1(TC_FLAG);
	else CLR1(TC_FLAG);
}
void tms3202x_device::blez()
{
	if ((int32_t)m_ACC.d <= 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::blkd()
{                                       /** Fix cycle timing **/
	if (m_init_load_addr) {
		m_PFC = m_cache.read_word(m_PC);
		m_PC++;
	}
	m_ALU.d = m_data.read_word(m_PFC);
	PUTDATA(m_ALU.d);
	m_PFC++;
	m_tms32025_dec_cycles += (1*CLK);
}
void tms3202x_device::blkp()
{                                       /** Fix cycle timing **/
	if (m_init_load_addr) {
		m_PFC = m_cache.read_word(m_PC);
		m_PC++;
	}
	m_ALU.d = m_cache.read_word(m_PFC);
	PUTDATA(m_ALU.d);
	m_PFC++;
	m_tms32025_dec_cycles += (2*CLK);
}
void tms3202x_device::blz()
{
	if ((int32_t)m_ACC.d < 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bnc()
{
	if (CARRY == 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bnv()
{
	if (OV == 0) m_PC = m_cache.read_word(m_PC);
	else {
		m_PC++;
		CLR0(OV_FLAG);
	}
	MODIFY_AR_ARP();
}
void tms3202x_device::bnz()
{
	if (m_ACC.d != 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bv()
{
	if (OV) {
		m_PC = m_cache.read_word(m_PC);
		CLR0(OV_FLAG);
	}
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::bz()
{
	if (m_ACC.d == 0) m_PC = m_cache.read_word(m_PC);
	else m_PC++;
	MODIFY_AR_ARP();
}
void tms3202x_device::cala()
{
	PUSH_STACK(m_PC);
	m_PC = m_ACC.w.l;
}
void tms3202x_device::call()
{
	m_PC++;
	PUSH_STACK(m_PC);
	m_PC = m_cache.read_word(m_PC - 1);
	MODIFY_AR_ARP();
}
void tms3202x_device::cmpl()
{
	m_ACC.d = (~m_ACC.d);
}
void tms3202x_device::cmpr()
{
	switch (m_opcode.b.l & 3)
	{
		case 0:
			if (m_AR[ARP] == m_AR[0]) SET1(TC_FLAG);
			else CLR1(TC_FLAG);
			break;
		case 1:
			if (m_AR[ARP] <  m_AR[0]) SET1(TC_FLAG);
			else CLR1(TC_FLAG);
			break;
		case 2:
			if (m_AR[ARP]  > m_AR[0]) SET1(TC_FLAG);
			else CLR1(TC_FLAG);
			break;
		case 3:
			if (m_AR[ARP] != m_AR[0]) SET1(TC_FLAG);
			else CLR1(TC_FLAG);
			break;
	}
}
void tms3202x_device::cnfd()  /** next two fetches need to use previous CNF value ! **/
{
	if(m_STR1 & CNF0_REG) {
		space(AS_PROGRAM).unmap_readwrite(0xff00, 0xffff);
		space(AS_DATA).install_ram(0x0200, 0x02ff, m_b0);
		CLR1(CNF0_REG);
	}
}
void tms3202x_device::cnfp()  /** next two fetches need to use previous CNF value ! **/
{
	if(!(m_STR1 & CNF0_REG)) {
		space(AS_PROGRAM).install_ram(0xff00, 0xffff, m_b0);
		space(AS_DATA).unmap_readwrite(0x0200, 0x02ff);
		SET1(CNF0_REG);
	}
}

void tms3202x_device::conf()
{
	// Disabled on tms32025
}

void tms32026_device::cnfd()
{
	// Disabled on tms32026
}

void tms32026_device::cnfp()
{
	// Disabled on tms32026
}

