mamedev/mame/src/devices/cpu/tms32025/tms32025.cpp
void tms32026_device::conf()  /** Need to reconfigure the memory blocks */
{
	int prev = ((m_STR1 & CNF1_REG) ? 2 : 0) | ((m_STR1 & CNF0_REG) ? 1 : 0);
	int next = m_opcode.b.l & 3;

	if(next & 1)
		SET1(CNF0_REG);
	else
		CLR1(CNF0_REG);

	if(next & 2)
		SET1(CNF1_REG);
	else
		CLR1(CNF1_REG);

	if(next < 1 && prev >= 1) {
		space(AS_PROGRAM).unmap_readwrite(0xfa00, 0xfbff);
		space(AS_DATA).install_ram(0x0200, 0x03ff, m_b0);
	} else if(next >= 1 && prev < 1) {
		space(AS_PROGRAM).install_ram(0xfa00, 0xfbff, m_b0);
		space(AS_DATA).unmap_readwrite(0x0200, 0x03ff);
	}

	if(next < 2 && prev >= 2) {
		space(AS_PROGRAM).unmap_readwrite(0xfc00, 0xfdff);
		space(AS_DATA).install_ram(0x0400, 0x05ff, m_b1);
	} else if(next >= 2 && prev < 2) {
		space(AS_PROGRAM).install_ram(0xfc00, 0xfdff, m_b1);
		space(AS_DATA).unmap_readwrite(0x0400, 0x05ff);
	}

	if(next < 3 && prev >= 3) {
		space(AS_PROGRAM).unmap_readwrite(0xfe00, 0xffff);
		space(AS_DATA).install_ram(0x0600, 0x07ff, m_b3);
	} else if(next >= 3 && prev < 3) {
		space(AS_PROGRAM).install_ram(0xfe00, 0xffff, m_b3);
		space(AS_DATA).unmap_readwrite(0x0600, 0x07ff);
	}
}
void tms3202x_device::dint()
{
	SET0(INTM_FLAG);
}
void tms3202x_device::dmov()  /** Careful with how memory is configured !! */
{
	GETDATA();
	m_data.write_word(m_memaccess + 1, m_ALU.w.l);
}
void tms3202x_device::eint()
{
	CLR0(INTM_FLAG);
}
void tms3202x_device::fort()
{
	if (m_opcode.b.l & 1) SET1(FO_FLAG);
	else CLR1(FO_FLAG);
}
void tms3202x_device::idle()
{
	CLR0(INTM_FLAG);
	m_idle = true;
}
void tms3202x_device::in()
{
	m_ALU.w.l = m_io.read_word(m_opcode.b.h & 0xf);
	PUTDATA(m_ALU.w.l);
}
void tms3202x_device::lac()
{
	GETDATA((m_opcode.b.h & 0xf), SXM);
	m_ACC.d = m_ALU.d;
}
void tms3202x_device::lack()      /* ZAC is a subset of this instruction */
{
	m_ACC.d = (uint8_t)m_opcode.b.l;
}
void tms3202x_device::lact()
{
	GETDATA((m_Treg & 0xf), SXM);
	m_ACC.d = m_ALU.d;
}
void tms3202x_device::lalk()
{
	if (SXM) m_ALU.d =  (int16_t)m_cache.read_word(m_PC);
	else     m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d = m_ALU.d;
}

template <unsigned N>
void tms3202x_device::lar_ar()   { GETDATA(); m_AR[N] = m_ALU.w.l; }

template <unsigned N>
void tms3202x_device::lark_ar()  { m_AR[N] = m_opcode.b.l; }

void tms3202x_device::ldp()
{
	GETDATA();
	MODIFY_DP(m_ALU.d & 0x1ff);
}
void tms3202x_device::ldpk()
{
	MODIFY_DP(m_opcode.w.l & 0x1ff);
}
void tms3202x_device::lph()
{
	GETDATA();
	m_Preg.w.h = m_ALU.w.l;
}
void tms3202x_device::lrlk()
{
	m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_AR[m_opcode.b.h & 7] = m_ALU.w.l;
}
void tms3202x_device::lst()
{
	GETDATA<true>();

	m_ALU.w.l &= (~INTM_FLAG);
	m_STR0 &= INTM_FLAG;
	m_STR0 |= m_ALU.w.l;        /* Must not affect INTM */
	m_STR0 |= 0x0400;
}
void tms3202x_device::lst1()
{
	GETDATA<true>();

	m_STR1 = m_ALU.w.l | m_fixed_STR1;
	m_STR0 &= (~ARP_REG);       /* ARB also gets copied to ARP */
	m_STR0 |= (m_STR1 & ARB_REG);
}
void tms3202x_device::lt()
{
	GETDATA();
	m_Treg = m_ALU.w.l;
}
void tms3202x_device::lta()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_Treg = m_ALU.w.l;
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::ltd()   /** Careful with how memory is configured !! */
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_Treg = m_ALU.w.l;
	m_data.write_word(m_memaccess+1, m_ALU.w.l);
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms3202x_device::ltp()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_Treg = m_ALU.w.l;
	SHIFT_Preg_TO_ALU();
	m_ACC.d = m_ALU.d;
}
void tms3202x_device::lts()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_Treg = m_ALU.w.l;
	SHIFT_Preg_TO_ALU();
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::mac()           /** RAM blocks B0,B1,B2 may be important ! */
{                               /** Fix cycle timing **/
	m_oldacc.d = m_ACC.d;
	if (m_init_load_addr) {
		m_PFC = m_cache.read_word(m_PC);
		m_PC++;
	}
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
	GETDATA();
	m_Treg = m_ALU.w.l;
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_cache.read_word(m_PFC);
	m_PFC++;
	m_tms32025_dec_cycles += (2*CLK);
}
void tms3202x_device::macd()          /** RAM blocks B0,B1,B2 may be important ! */
{                                                   /** Fix cycle timing **/
	m_oldacc.d = m_ACC.d;
	if (m_init_load_addr) {
		m_PFC = m_cache.read_word(m_PC);
		m_PC++;
	}
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
	GETDATA();
	if ((m_opcode.b.l & 0x80) || m_init_load_addr) {  /* No writing during repetition, or DMA mode */
		m_data.write_word(m_memaccess+1, m_ALU.w.l);
	}
	m_Treg = m_ALU.w.l;
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_cache.read_word(m_PFC);
	m_PFC++;
	m_tms32025_dec_cycles += (2*CLK);
}
void tms3202x_device::mar()       /* LARP and NOP are a subset of this instruction */
{
	if (m_opcode.b.l & 0x80) MODIFY_AR_ARP();
}
void tms3202x_device::mpy()
{
	GETDATA();
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_Treg;
}
void tms3202x_device::mpya()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
	GETDATA();
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_Treg;
}
void tms3202x_device::mpyk()
{
	m_Preg.d = (int16_t)m_Treg * (int16_t(m_opcode.w.l << 3) >> 3);
}
void tms3202x_device::mpys()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
	GETDATA();
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_Treg;
}
void tms3202x_device::mpyu()
{
	GETDATA();
	m_Preg.d = (uint16_t)m_ALU.w.l * (uint16_t)m_Treg;
}
void tms3202x_device::neg()
{
	if (m_ACC.d == 0x80000000) {
		SET0(OV_FLAG);
		if (OVM) m_ACC.d = 0x7fffffff;
	}
	else m_ACC.d = -m_ACC.d;
	if (m_ACC.d) CLR1(C_FLAG);
	else SET1(C_FLAG);
}
/*
void tms3202x_device::nop() { }   // NOP is a subset of the MAR instruction
*/
void tms3202x_device::norm()
{
	if (m_ACC.d !=0 && int32_t(m_ACC.d ^ (m_ACC.d << 1)) >= 0)
	{
		CLR1(TC_FLAG);
		m_ACC.d <<= 1;
		MODIFY_AR_ARP();
	}
	else SET1(TC_FLAG);
}
void tms3202x_device::or_()
{
	GETDATA();
	m_ACC.w.l |= m_ALU.w.l;
}
void tms3202x_device::ork()
{
	m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d |=  (m_ALU.d);
}
void tms3202x_device::out()
{
	GETDATA();
	m_io.write_word(m_opcode.b.h & 0xf, m_ALU.w.l );
}
void tms3202x_device::pac()
{
	SHIFT_Preg_TO_ALU();
	m_ACC.d = m_ALU.d;
}
void tms3202x_device::pop()
{
	m_ACC.d = (uint16_t)POP_STACK();
}
void tms3202x_device::popd()
{
	m_ALU.d = (uint16_t)POP_STACK();
	PUTDATA(m_ALU.w.l);
}
void tms3202x_device::pshd()
{
	GETDATA();
	PUSH_STACK(m_ALU.w.l);
}
void tms3202x_device::push()
{
	PUSH_STACK(m_ACC.w.l);
}
void tms3202x_device::rc()
{
	CLR1(C_FLAG);
}
void tms3202x_device::ret()
{
	m_PC = POP_STACK();
}
void tms3202x_device::rfsm()              /** serial port mode */
{
	CLR1(FSM_FLAG);
}
void tms3202x_device::rhm()
{
	CLR1(HM_FLAG);
}
void tms3202x_device::rol()
{
	m_ALU.d = m_ACC.d;
	m_ACC.d <<= 1;
	if (CARRY) m_ACC.d |= 1;
	if (m_ALU.d & 0x80000000) SET1(C_FLAG);
	else CLR1(C_FLAG);
}
void tms3202x_device::ror()
{
	m_ALU.d = m_ACC.d;
	m_ACC.d >>= 1;
	if (CARRY) m_ACC.d |= 0x80000000;
	if (m_ALU.d & 1) SET1(C_FLAG);
	else CLR1(C_FLAG);
}
void tms3202x_device::rovm()
{
	CLR0(OVM_FLAG);
}
void tms3202x_device::rpt()
{
	GETDATA();
	m_RPTC = m_ALU.b.l;
	m_init_load_addr = 2;       /* Initiate repeat mode */
}
void tms3202x_device::rptk()
{
	m_RPTC = m_opcode.b.l;
	m_init_load_addr = 2;       /* Initiate repeat mode */
}
void tms3202x_device::rsxm()
{
	CLR1(SXM_FLAG);
}
void tms3202x_device::rtc()
{
	CLR1(TC_FLAG);
}
void tms3202x_device::rtxm()  /** Serial port stuff */
{
	CLR1(TXM_FLAG);
}
void tms3202x_device::rxf()
{
	CLR1(XF_FLAG);
	m_xf_out(CLEAR_LINE);
}
void tms3202x_device::sach()
{
	m_ALU.d = (m_ACC.d << (m_opcode.b.h & 7));
	PUTDATA(m_ALU.w.h);
}
void tms3202x_device::sacl()
{
	m_ALU.d = (m_ACC.d << (m_opcode.b.h & 7));
	PUTDATA(m_ALU.w.l);
}

template<unsigned N>
void tms3202x_device::sar_ar()   { PUTDATA(m_AR[N]); }

void tms3202x_device::sblk()
{
	m_oldacc.d = m_ACC.d;
	if (SXM) m_ALU.d =  (int16_t)m_cache.read_word(m_PC);
	else     m_ALU.d = (uint16_t)m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::sbrk_ar()
{
	m_AR[ARP] -= m_opcode.b.l;
}
void tms3202x_device::sc()
{
	SET1(C_FLAG);
}
void tms3202x_device::sfl()
{
	m_ALU.d = m_ACC.d;
	m_ACC.d <<= 1;
	if (m_ALU.d & 0x80000000) SET1(C_FLAG);
	else CLR1(C_FLAG);
}
void tms3202x_device::sfr()
{
	m_ALU.d = m_ACC.d;
	m_ACC.d >>= 1;
	if (SXM) {
		if (m_ALU.d & 0x80000000) m_ACC.d |= 0x80000000;
	}
	if (m_ALU.d & 1) SET1(C_FLAG);
	else CLR1(C_FLAG);
}
void tms3202x_device::sfsm()  /** Serial port mode */
{
	SET1(FSM_FLAG);
}
void tms3202x_device::shm()
{
	SET1(HM_FLAG);
}
void tms3202x_device::sovm()
{
	SET0(OVM_FLAG);
}
void tms3202x_device::spac()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::sph()
{
	SHIFT_Preg_TO_ALU();
	PUTDATA(m_ALU.w.h);
}
void tms3202x_device::spl()
{
	SHIFT_Preg_TO_ALU();
	PUTDATA(m_ALU.w.l);
}
void tms3202x_device::spm()
{
	MODIFY_PM((m_opcode.b.l & 3) );
}
void tms3202x_device::sqra()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
	GETDATA();
	m_Treg = m_ALU.w.l;
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_ALU.w.l;
}
void tms3202x_device::sqrs()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
	GETDATA();
	m_Treg = m_ALU.w.l;
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_ALU.w.l;
}
void tms3202x_device::sst()
{
	PUTDATA_SST(m_STR0);
}
void tms3202x_device::sst1()
{
	PUTDATA_SST(m_STR1);
}
void tms3202x_device::ssxm()
{
	SET1(SXM_FLAG);
}
void tms3202x_device::stc()
{
	SET1(TC_FLAG);
}
void tms3202x_device::stxm()      /** Serial port stuff */
{
	SET1(TXM_FLAG);
}
void tms3202x_device::sub()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_opcode.b.h & 0xf), SXM);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::subb()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	if (CARRY == 0) m_ACC.d--;
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	if (m_ACC.d == m_oldacc.d) {}   /* edge case, carry remains same */
	else CALCULATE_SUB_CARRY();
}
void tms3202x_device::subc()
{
	m_oldacc.d = m_ACC.d;
	GETDATA(15, SXM);
	m_ACC.d -= m_ALU.d;     /* Temporary switch to ACC. Actual calculation is done as (ACC)-[mem] -> ALU, will be preserved later on. */
	if (int32_t((m_oldacc.d ^ m_ALU.d) & (m_oldacc.d ^ m_ACC.d)) < 0) {
		SET0(OV_FLAG);            /* Not affected by OVM */
	}
	CALCULATE_SUB_CARRY();
	if( m_oldacc.d >= m_ALU.d ) {
		m_ALU.d = m_ACC.d;
		m_ACC.d = m_ACC.d << 1 | 1;
	}
	else {
		m_ALU.d = m_ACC.d;
		m_ACC.d = m_oldacc.d << 1;
	}
}
void tms3202x_device::subh()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_ACC.w.h -= m_ALU.w.l;
	if ((uint16_t)m_oldacc.w.h < (uint16_t)m_ACC.w.h) {
		CLR1(C_FLAG); /* Carry flag is not affected, if no borrow occurred */
	}
	if (int16_t((m_oldacc.w.h ^ m_ALU.w.l) & (m_oldacc.w.h ^ m_ACC.w.h)) < 0) {
		SET0(OV_FLAG);
		if (OVM) m_ACC.w.h = ((int16_t)m_oldacc.w.h < 0) ? 0x8000 : 0x7fff;
	}
}
void tms3202x_device::subk()
{
	m_oldacc.d = m_ACC.d;
	m_ALU.d = (uint8_t)m_opcode.b.l;
	m_ACC.d -= m_ALU.b.l;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::subs()
{
	m_oldacc.d = m_ACC.d;
	GETDATA();
	m_ACC.d -= m_ALU.w.l;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::subt()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_Treg & 0xf), SXM);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
	CALCULATE_SUB_CARRY();
}
void tms3202x_device::sxf()
{
	SET1(XF_FLAG);
	m_xf_out(ASSERT_LINE);
}
void tms3202x_device::tblr()
{
	if (m_init_load_addr) {
		m_PFC = m_ACC.w.l;
	}
	m_ALU.w.l = m_cache.read_word(m_PFC);
	if (CNF0 && (uint16_t)m_PFC >= 0xff00) {}   /** TMS32025 only */
	else m_tms32025_dec_cycles += (1*CLK);
	PUTDATA(m_ALU.w.l);
	m_PFC++;
}
void tms3202x_device::tblw()
{
	if (m_init_load_addr) {
		m_PFC = m_ACC.w.l;
	}
	m_tms32025_dec_cycles += (1*CLK);
	GETDATA();
	if (is_mem_access_external()) m_tms32025_dec_cycles += (1*CLK);
	m_program.write_word(m_PFC, m_ALU.w.l);
	m_PFC++;
}
void tms3202x_device::trap()
{
	PUSH_STACK(m_PC);
	m_PC = 0x001E;     /* Trap vector */
}
void tms3202x_device::xor_()
{
	GETDATA();
	m_ACC.w.l ^= m_ALU.w.l;
}
void tms3202x_device::xork()
{
	m_ALU.d = m_cache.read_word(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d ^= m_ALU.d;
}
void tms3202x_device::zalh()
{
	GETDATA();
	m_ACC.w.h = m_ALU.w.l;
	m_ACC.w.l = 0x0000;
}
void tms3202x_device::zalr()
{
	GETDATA();
	m_ACC.w.h = m_ALU.w.l;
	m_ACC.w.l = 0x8000;
}
void tms3202x_device::zals()
{
	GETDATA();
	m_ACC.w.l = m_ALU.w.l;
	m_ACC.w.h = 0x0000;
}


/***********************************************************************
 *  Opcode Table (Cycles, Instruction)
 ***********************************************************************/

const tms3202x_device::tms32025_opcode tms3202x_device::s_opcode_main[256]=
{
/*00*/ {1*CLK, &tms3202x_device::add      },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },
/*08*/ {1*CLK, &tms3202x_device::add      },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },{1*CLK, &tms3202x_device::add       },
/*10*/ {1*CLK, &tms3202x_device::sub      },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },
/*18*/ {1*CLK, &tms3202x_device::sub      },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },{1*CLK, &tms3202x_device::sub       },
/*20*/ {1*CLK, &tms3202x_device::lac      },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },
/*28*/ {1*CLK, &tms3202x_device::lac      },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },{1*CLK, &tms3202x_device::lac       },
/*30*/ {1*CLK, &tms3202x_device::lar_ar<0>},{1*CLK, &tms3202x_device::lar_ar<1> },{1*CLK, &tms3202x_device::lar_ar<2> },{1*CLK, &tms3202x_device::lar_ar<3> },{1*CLK, &tms3202x_device::lar_ar<4> },{1*CLK, &tms3202x_device::lar_ar<5>},{1*CLK, &tms3202x_device::lar_ar<6>  },{1*CLK, &tms3202x_device::lar_ar<7> },
/*38*/ {1*CLK, &tms3202x_device::mpy      },{1*CLK, &tms3202x_device::sqra      },{1*CLK, &tms3202x_device::mpya      },{1*CLK, &tms3202x_device::mpys      },{1*CLK, &tms3202x_device::lt        },{1*CLK, &tms3202x_device::lta       },{1*CLK, &tms3202x_device::ltp       },{1*CLK, &tms3202x_device::ltd       },
/*40*/ {1*CLK, &tms3202x_device::zalh     },{1*CLK, &tms3202x_device::zals      },{1*CLK, &tms3202x_device::lact      },{1*CLK, &tms3202x_device::addc      },{1*CLK, &tms3202x_device::subh      },{1*CLK, &tms3202x_device::subs      },{1*CLK, &tms3202x_device::subt      },{1*CLK, &tms3202x_device::subc      },
/*48*/ {1*CLK, &tms3202x_device::addh     },{1*CLK, &tms3202x_device::adds      },{1*CLK, &tms3202x_device::addt      },{1*CLK, &tms3202x_device::rpt       },{1*CLK, &tms3202x_device::xor_      },{1*CLK, &tms3202x_device::or_       },{1*CLK, &tms3202x_device::and_      },{1*CLK, &tms3202x_device::subb      },
/*50*/ {1*CLK, &tms3202x_device::lst      },{1*CLK, &tms3202x_device::lst1      },{1*CLK, &tms3202x_device::ldp       },{1*CLK, &tms3202x_device::lph       },{1*CLK, &tms3202x_device::pshd      },{1*CLK, &tms3202x_device::mar       },{1*CLK, &tms3202x_device::dmov      },{1*CLK, &tms3202x_device::bitt      },
/*58*/ {3*CLK, &tms3202x_device::tblr     },{2*CLK, &tms3202x_device::tblw      },{1*CLK, &tms3202x_device::sqrs      },{1*CLK, &tms3202x_device::lts       },{2*CLK, &tms3202x_device::macd      },{2*CLK, &tms3202x_device::mac       },{2*CLK, &tms3202x_device::bc        },{2*CLK, &tms3202x_device::bnc       },
/*60*/ {1*CLK, &tms3202x_device::sacl     },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },{1*CLK, &tms3202x_device::sacl      },
/*68*/ {1*CLK, &tms3202x_device::sach     },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },{1*CLK, &tms3202x_device::sach      },
/*70*/ {1*CLK, &tms3202x_device::sar_ar<0>},{1*CLK, &tms3202x_device::sar_ar<1> },{1*CLK, &tms3202x_device::sar_ar<2> },{1*CLK, &tms3202x_device::sar_ar<3> },{1*CLK, &tms3202x_device::sar_ar<4> },{1*CLK, &tms3202x_device::sar_ar<5> },{1*CLK, &tms3202x_device::sar_ar<6> },{1*CLK, &tms3202x_device::sar_ar<7> },
/*78*/ {1*CLK, &tms3202x_device::sst      },{1*CLK, &tms3202x_device::sst1      },{1*CLK, &tms3202x_device::popd      },{1*CLK, &tms3202x_device::zalr      },{1*CLK, &tms3202x_device::spl       },{1*CLK, &tms3202x_device::sph       },{1*CLK, &tms3202x_device::adrk      },{1*CLK, &tms3202x_device::sbrk_ar   },
/*80*/ {2*CLK, &tms3202x_device::in       },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },
/*88*/ {2*CLK, &tms3202x_device::in       },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },{2*CLK, &tms3202x_device::in        },
/*90*/ {1*CLK, &tms3202x_device::bit      },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },
/*98*/ {1*CLK, &tms3202x_device::bit      },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },{1*CLK, &tms3202x_device::bit       },
/*A0*/ {1*CLK, &tms3202x_device::mpyk     },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },
/*A8*/ {1*CLK, &tms3202x_device::mpyk     },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },
/*B0*/ {1*CLK, &tms3202x_device::mpyk     },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },
/*B8*/ {1*CLK, &tms3202x_device::mpyk     },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },{1*CLK, &tms3202x_device::mpyk      },
/*C0*/ {1*CLK, &tms3202x_device::lark_ar<0>},{1*CLK, &tms3202x_device::lark_ar<1>},{1*CLK, &tms3202x_device::lark_ar<2>},{1*CLK, &tms3202x_device::lark_ar<3>},{1*CLK, &tms3202x_device::lark_ar<4>},{1*CLK, &tms3202x_device::lark_ar<5>},{1*CLK, &tms3202x_device::lark_ar<6>},{1*CLK, &tms3202x_device::lark_ar<7>},
/*C8*/ {1*CLK, &tms3202x_device::ldpk     },{1*CLK, &tms3202x_device::ldpk      },{1*CLK, &tms3202x_device::lack      },{1*CLK, &tms3202x_device::rptk      },{1*CLK, &tms3202x_device::addk      },{1*CLK, &tms3202x_device::subk      },{1*CLK, &tms3202x_device::opcodes_CE},{1*CLK, &tms3202x_device::mpyu      },
/*D0*/ {1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{0*CLK, &tms3202x_device::opcodes_Dx},
/*D8*/ {1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},{1*CLK, &tms3202x_device::opcodes_Dx},
/*E0*/ {2*CLK, &tms3202x_device::out      },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },
/*E8*/ {2*CLK, &tms3202x_device::out      },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },{2*CLK, &tms3202x_device::out       },
/*F0*/ {2*CLK, &tms3202x_device::bv       },{2*CLK, &tms3202x_device::bgz       },{2*CLK, &tms3202x_device::blez      },{2*CLK, &tms3202x_device::blz       },{2*CLK, &tms3202x_device::bgez      },{2*CLK, &tms3202x_device::bnz       },{2*CLK, &tms3202x_device::bz        },{2*CLK, &tms3202x_device::bnv       },
/*F8*/ {2*CLK, &tms3202x_device::bbz      },{2*CLK, &tms3202x_device::bbnz      },{2*CLK, &tms3202x_device::bioz      },{2*CLK, &tms3202x_device::banz      },{2*CLK, &tms3202x_device::blkp      },{2*CLK, &tms3202x_device::blkd      },{2*CLK, &tms3202x_device::call      },{2*CLK, &tms3202x_device::br        }
};

