mamedev/mame/src/devices/cpu/tms32025/tms32025.cpp
const tms3202x_device::tms32025_opcode tms3202x_device::s_opcode_CE_subset[256]=  /* Instructions living under the CExx opcode */
{
/*00*/ {1*CLK, &tms3202x_device::eint     },{1*CLK, &tms3202x_device::dint      },{1*CLK, &tms3202x_device::rovm      },{1*CLK, &tms3202x_device::sovm      },{1*CLK, &tms3202x_device::cnfd      },{1*CLK, &tms3202x_device::cnfp      },{1*CLK, &tms3202x_device::rsxm      },{1*CLK, &tms3202x_device::ssxm      },
/*08*/ {1*CLK, &tms3202x_device::spm      },{1*CLK, &tms3202x_device::spm       },{1*CLK, &tms3202x_device::spm       },{1*CLK, &tms3202x_device::spm       },{1*CLK, &tms3202x_device::rxf       },{1*CLK, &tms3202x_device::sxf       },{1*CLK, &tms3202x_device::fort      },{1*CLK, &tms3202x_device::fort      },
/*10*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::pac       },{1*CLK, &tms3202x_device::apac      },{1*CLK, &tms3202x_device::spac      },{0*CLK, &tms3202x_device::illegal   },
/*18*/ {1*CLK, &tms3202x_device::sfl      },{1*CLK, &tms3202x_device::sfr       },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::abst      },{1*CLK, &tms3202x_device::push      },{1*CLK, &tms3202x_device::pop       },{2*CLK, &tms3202x_device::trap      },{3*CLK, &tms3202x_device::idle      },
/*20*/ {1*CLK, &tms3202x_device::rtxm     },{1*CLK, &tms3202x_device::stxm      },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::neg       },{2*CLK, &tms3202x_device::cala      },{2*CLK, &tms3202x_device::bacc      },{2*CLK, &tms3202x_device::ret       },{1*CLK, &tms3202x_device::cmpl      },
/*28*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*30*/ {1*CLK, &tms3202x_device::rc       },{1*CLK, &tms3202x_device::sc        },{1*CLK, &tms3202x_device::rtc       },{1*CLK, &tms3202x_device::stc       },{1*CLK, &tms3202x_device::rol       },{1*CLK, &tms3202x_device::ror       },{1*CLK, &tms3202x_device::rfsm      },{1*CLK, &tms3202x_device::sfsm      },
/*38*/ {1*CLK, &tms3202x_device::rhm      },{1*CLK, &tms3202x_device::shm       },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::conf      },{1*CLK, &tms3202x_device::conf      },{1*CLK, &tms3202x_device::conf      },{1*CLK, &tms3202x_device::conf      },
/*40*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*48*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*50*/ {1*CLK, &tms3202x_device::cmpr     },{1*CLK, &tms3202x_device::cmpr      },{1*CLK, &tms3202x_device::cmpr      },{1*CLK, &tms3202x_device::cmpr      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*58*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*60*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*68*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*70*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*78*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*80*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*88*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*90*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*98*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*A0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*A8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*B0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*B8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*C0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*C8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*D0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*D8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*E0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*E8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*F0*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{1*CLK, &tms3202x_device::norm      },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },
/*F8*/ {0*CLK, &tms3202x_device::illegal  },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   },{0*CLK, &tms3202x_device::illegal   }
};

const tms3202x_device::tms32025_opcode tms3202x_device::s_opcode_Dx_subset[8]=    /* Instructions living under the Dxxx opcode */
{
/*00*/ {2*CLK, &tms3202x_device::lrlk     },{2*CLK, &tms3202x_device::lalk      },{2*CLK, &tms3202x_device::adlk      },{2*CLK, &tms3202x_device::sblk      },{2*CLK, &tms3202x_device::andk      },{2*CLK, &tms3202x_device::ork       },{2*CLK, &tms3202x_device::xork      },{0*CLK, &tms3202x_device::illegal   }
};



/****************************************************************************
 *  Initialise the CPU emulation
 ****************************************************************************/
void tms3202x_device::device_start()
{
	space(AS_PROGRAM).cache(m_cache);
	space(AS_PROGRAM).specific(m_program);
	space(AS_DATA).specific(m_data);
	space(AS_IO).specific(m_io);

	m_PREVPC = 0;
	m_PFC = 0;
	m_STR0 = 0;
	m_STR1 = m_fixed_STR1;
	m_ACC.d = 0;
	m_Preg.d = 0;
	m_Treg = 0;
	m_AR[0] = m_AR[1] = m_AR[2] = m_AR[3] = m_AR[4] = m_AR[5] = m_AR[6] = m_AR[7] = 0;
	m_STACK[0] = m_STACK[1] = m_STACK[2] = m_STACK[3] = m_STACK[4] = m_STACK[5] = m_STACK[6] = m_STACK[7] = 0;
	m_ALU.d = 0;
	m_drr = 0;
	m_dxr = 0;
	m_timerover = 0;
	m_opcode.d = 0;
	m_memaccess = 0;
	m_waiting_for_serial_frame = false;

	save_item(NAME(m_PREVPC));
	save_item(NAME(m_PC));
	save_item(NAME(m_PFC));
	save_item(NAME(m_STR0));
	save_item(NAME(m_STR1));
	save_item(NAME(m_IFR));
	save_item(NAME(m_RPTC));
	save_item(NAME(m_ACC.d));
	save_item(NAME(m_ALU.d));
	save_item(NAME(m_Preg.d));
	save_item(NAME(m_Treg));
	save_item(NAME(m_AR));
	save_item(NAME(m_STACK));

	save_item(NAME(m_drr));
	save_item(NAME(m_dxr));
	save_item(NAME(m_tim));
	save_item(NAME(m_prd));
	save_item(NAME(m_imr));
	save_item(NAME(m_greg));
	save_item(NAME(m_timerover));

	save_item(NAME(m_idle));
	save_item(NAME(m_hold));
	save_item(NAME(m_init_load_addr));

	save_item(NAME(m_memaccess));
	save_item(NAME(m_waiting_for_serial_frame));

	state_add( TMS32025_PC,   "PC",   m_PC).formatstr("%04X");
	state_add( TMS32025_STR0, "STR0", m_STR0).formatstr("%04X");
	state_add( TMS32025_STR1, "STR1", m_STR1).formatstr("%04X");
	state_add( TMS32025_IFR,  "IFR",  m_IFR).formatstr("%04X");
	state_add( TMS32025_RPTC, "RPTC", m_RPTC).formatstr("%02X");
	state_add( TMS32025_STK7, "STK7", m_STACK[7]).formatstr("%04X");
	state_add( TMS32025_STK6, "STK6", m_STACK[6]).formatstr("%04X");
	state_add( TMS32025_STK5, "STK5", m_STACK[5]).formatstr("%04X");
	state_add( TMS32025_STK4, "STK4", m_STACK[4]).formatstr("%04X");
	state_add( TMS32025_STK3, "STK3", m_STACK[3]).formatstr("%04X");
	state_add( TMS32025_STK2, "STK2", m_STACK[2]).formatstr("%04X");
	state_add( TMS32025_STK1, "STK1", m_STACK[1]).formatstr("%04X");
	state_add( TMS32025_STK0, "STK0", m_STACK[0]).formatstr("%04X");
	state_add( TMS32025_ACC,  "ACC",  m_ACC.d).formatstr("%08X");
	state_add( TMS32025_PREG, "P",    m_Preg.d).formatstr("%08X");
	state_add( TMS32025_TREG, "T",    m_Treg).formatstr("%04X");
	state_add( TMS32025_AR0,  "AR0",  m_AR[0]).formatstr("%04X");
	state_add( TMS32025_AR1,  "AR1",  m_AR[1]).formatstr("%04X");
	state_add( TMS32025_AR2,  "AR2",  m_AR[2]).formatstr("%04X");
	state_add( TMS32025_AR3,  "AR3",  m_AR[3]).formatstr("%04X");
	state_add( TMS32025_AR4,  "AR4",  m_AR[4]).formatstr("%04X");
	state_add( TMS32025_AR5,  "AR5",  m_AR[5]).formatstr("%04X");
	state_add( TMS32025_AR6,  "AR6",  m_AR[6]).formatstr("%04X");
	state_add( TMS32025_AR7,  "AR7",  m_AR[7]).formatstr("%04X");
	state_add( TMS32025_DRR,  "DRR",  m_drr).formatstr("%04X");
	state_add( TMS32025_DXR,  "DXR",  m_dxr).formatstr("%04X");
	state_add( TMS32025_TIM,  "TIM",  m_tim).formatstr("%04X");
	state_add( TMS32025_PRD,  "PRD",  m_prd).formatstr("%04X");
	state_add( TMS32025_IMR,  "IMR",  m_imr).formatstr("%04X");
	state_add( TMS32025_GREG, "GREG", m_greg).formatstr("%04X");

	state_add(STATE_GENPC, "GENPC", m_PC).formatstr("%04X").noshow();
	state_add(STATE_GENPCBASE, "CURPC", m_PREVPC).formatstr("%04X").noshow();
	state_add(STATE_GENFLAGS, "GENFLAGS",  m_STR0).formatstr("%33s").noshow();

	set_icountptr(m_icount);
}

void tms32025_device::device_start()
{
	tms3202x_device::device_start();

	if (!m_mp_mc) // if pin 1 is 0 then we're using internal ROM
	{
		m_program.space().install_rom(0x0000, 0x0fff, memregion("internal")->base());
	}

	save_item(NAME(m_mp_mc));
}


void tms3202x_device::state_string_export(const device_state_entry &entry, std::string &str) const
{
	switch (entry.index())
	{
		case STATE_GENFLAGS:
			str = string_format("arp%d%c%c%c%cdp%03x  arb%d%c%c%c%c%c%c%c%c%c%c%cpm%d",
				(m_STR0 & 0xe000) >> 13,
				m_STR0 & 0x1000 ? 'O':'.',
				m_STR0 & 0x0800 ? 'M':'.',
				m_STR0 & 0x0400 ? '.':'?',
				m_STR0 & 0x0200 ? 'I':'.',
				(m_STR0 & 0x01ff),

				(m_STR1 & 0xe000) >> 13,
				m_STR1 & 0x1000 ? 'P':'D',
				m_STR1 & 0x0800 ? 'T':'.',
				m_STR1 & 0x0400 ? 'S':'.',
				m_STR1 & 0x0200 ? 'C':'?',
				m_STR0 & 0x0100 ? '.':'?',
				m_STR1 & 0x0080 ? '.':'?',
				m_STR1 & 0x0040 ? 'H':'.',
				m_STR1 & 0x0020 ? 'F':'.',
				m_STR1 & 0x0010 ? 'X':'.',
				m_STR1 & 0x0008 ? 'f':'.',
				m_STR1 & 0x0004 ? 'o':'i',
				(m_STR1 & 0x0003)
			);
			break;
	}
}


/****************************************************************************
 *  Reset registers to their initial values
 ****************************************************************************/
void tms3202x_device::common_reset()
{
	m_PC = 0;                          /* Starting address on a reset */
	m_STR0 |= 0x0600;                  /* INTM and unused bit set to 1 */
	m_STR0 &= 0xefff;                  /* OV cleared to 0. Remaining bits undefined */
	m_STR1 |= 0x0670 | m_fixed_STR1;   /* SXM, C, HM, FSM, XF and unused bits set to 1 */
	m_STR1 &= 0xeff0;                  /* CNF, FO, TXM, PM bits cleared to 0. Remaining bits undefined */
	m_RPTC = 0;                        /* Reset repeat counter to 0 */
	m_IFR = 0;                         /* IRQ pending flags */

