mamedev/mame/src/devices/cpu/tms32025/tms32025.cpp
	m_xf_out(ASSERT_LINE); /* XF flag is high. Must set the pin */

	m_greg = 0;
	m_tim  = 0xffff;
	m_prd  = 0xffff;
	m_imr  = 0xffc0;

	m_idle = false;
	m_hold = false;
	m_tms32025_dec_cycles = 0;
	m_init_load_addr = 1;
}

void tms3202x_device::device_reset()
{
	if(m_STR1 & CNF0_REG) {
		m_program.space().unmap_readwrite(0xff00, 0xffff);
		m_data.space().install_ram(0x0200, 0x02ff, m_b0);
	}
	common_reset();

}

void tms32026_device::device_reset()
{
	common_reset();
}


/****************************************************************************
 *  Issue an interrupt if necessary
 ****************************************************************************/
inline int tms3202x_device::process_IRQs()
{
	/********** Interrupt Flag Register (IFR) **********
	    |  5  |  4  |  3  |  2  |  1  |  0  |
	    | XINT| RINT| TINT| INT2| INT1| INT0|
	*/

	/* Dont service Interrupts if masked, or prev instruction was EINT ! */

	if ( (INTM == 0) && (m_opcode.w.l != 0xce00) && (m_IFR & m_imr) )
	{
		const int irq_cycles = (3*CLK);    /* 3 clock cycles used due to PUSH and DINT operation ? */
		PUSH_STACK(m_PC);

		if ((m_IFR & 0x01) && (m_imr & 0x01)) {       /* IRQ line 0 */
			//logerror("TMS3202x:  Active INT0\n");
			standard_irq_callback(0, m_PC);
			m_PC = 0x0002;
			m_idle = false;
			m_IFR &= (~0x01);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
		if ((m_IFR & 0x02) && (m_imr & 0x02)) {       /* IRQ line 1 */
			//logerror("TMS3202x:  Active INT1\n");
			standard_irq_callback(1, m_PC);
			m_PC = 0x0004;
			m_idle = false;
			m_IFR &= (~0x02);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
		if ((m_IFR & 0x04) && (m_imr & 0x04)) {       /* IRQ line 2 */
			//logerror("TMS3202x:  Active INT2\n");
			standard_irq_callback(2, m_PC);
			m_PC = 0x0006;
			m_idle = false;
			m_IFR &= (~0x04);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
		if ((m_IFR & 0x08) && (m_imr & 0x08)) {       /* Timer IRQ (internal) */
			//logerror("TMS3202x:  Active TINT (Timer)\n");
			m_PC = 0x0018;
			m_idle = false;
			m_IFR &= (~0x08);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
		if ((m_IFR & 0x10) && (m_imr & 0x10)) {       /* Serial port receive IRQ (internal) */
			//logerror("TMS3202x:  Active RINT (Serial receive)\n");
			m_drr = m_dr_in();
			m_PC = 0x001A;
			m_idle = false;
			m_IFR &= (~0x10);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
		if ((m_IFR & 0x20) && (m_imr & 0x20)) {       /* Serial port transmit IRQ (internal) */
			//logerror("TMS3202x:  Active XINT (Serial transmit)\n");
			m_dx_out(m_dxr);
			m_PC = 0x001C;
			m_idle = false;
			m_IFR &= (~0x20);
			SET0(INTM_FLAG);
			return irq_cycles;
		}
	}
	return 0;
}


inline void tms3202x_device::process_timer(int clocks)
{
	while (true)
	{
		int const preclocks = CLK - m_timerover;
		if (clocks < preclocks)
		{
			/* easy case: no actual ticks */
			m_timerover += clocks;
			m_icount -= clocks;
			break;
		}

		int const ticks = 1 + (clocks - preclocks) / CLK;
		if (ticks <= m_tim)
		{
			/* if we're not going to overflow the timer, just count the clocks */
			m_icount -= clocks;
			m_timerover = clocks - (ticks - 1) * CLK - preclocks;
			m_tim -= ticks;
			break;
		}

		/* otherwise, overflow the timer and signal an interrupt */
		m_icount -= preclocks + CLK * m_tim;
		m_timerover = 0;
		m_tim = m_prd;

		m_IFR |= 0x08;
		clocks = process_IRQs();        /* Handle Timer IRQ */
	}
}


/****************************************************************************
 *  Execute ICount cycles. Exit when 0 or less
 ****************************************************************************/
void tms3202x_device::execute_run()
{
	/**** Respond to external hold signal */
	if (m_hold_in() == ASSERT_LINE) {
		if (!m_hold) {
			m_hold_ack_out(ASSERT_LINE);  /* Hold-Ack (active low) */
			m_hold = true;
		}

		if (HM || is_mem_access_external()) {
			m_icount = 0;   /* Exit */
			return;
		}
	}
	else if (m_hold) {
		m_hold_ack_out(CLEAR_LINE);   /* Hold-Ack (active low) */
		process_timer(3);
		m_hold = false;
	}

	/**** If idling, update timer and/or exit execution, but test for irqs first */
	if (m_idle && m_IFR && m_icount > 0)
		m_icount -= process_IRQs();

	if (m_idle) {
		debugger_wait_hook();
		while (m_idle && m_icount > 0)
			process_timer(m_icount);
	}

	while (m_icount > 0)
	{
		m_tms32025_dec_cycles = 0;

		if (m_IFR) {    /* Check IRQ Flag Register for pending IRQs */
			m_tms32025_dec_cycles += process_IRQs();
		}

		m_PREVPC = m_PC;

		debugger_instruction_hook(m_PC);

		m_opcode.d = m_cache.read_word(m_PC);
		m_PC++;

		if (m_opcode.b.h == 0xCE)   /* Opcode 0xCExx has many sub-opcodes in its minor byte */
		{
			m_tms32025_dec_cycles += s_opcode_CE_subset[m_opcode.b.l].cycles;
			(this->*s_opcode_CE_subset[m_opcode.b.l].function)();
		}
		else if ((m_opcode.w.l & 0xf0f8) == 0xd000) /* Opcode 0xDxxx has many sub-opcodes in its minor byte */
		{
			m_tms32025_dec_cycles += s_opcode_Dx_subset[m_opcode.b.l].cycles;
			(this->*s_opcode_Dx_subset[m_opcode.b.l].function)();
		}
		else            /* Do all opcodes except the CExx and Dxxx ones */
		{
			m_tms32025_dec_cycles += s_opcode_main[m_opcode.b.h].cycles;
			(this->*s_opcode_main[m_opcode.b.h].function)();
		}


		if (m_init_load_addr == 2) {        /* Repeat next instruction */
			/****************************************************\
			******* These instructions are not repeatable ********
			** ADLK, ANDK, LALK, LRLK, ORK,  SBLK, XORK         **
			** ADDK, ADRK, LACK, LARK, LDPK, MPYK, RPTK         **
			** SBRK, SPM,  SUBK, ZAC,  IDLE, RPT,  TRAP         **
			** BACC, CALA, RET                                  **
			** B,    BANZ, BBNZ, BBZ,  BC,   BGEZ, BGZ,  BIOZ   **
			** BNC,  BNV,  BNZ,  BV,   BZ,   CALL, BLEZ, BLZ    **
			\****************************************************/
			m_PREVPC = m_PC;

			debugger_instruction_hook(m_PC);

			m_opcode.d = m_cache.read_word(m_PC);
			m_PC++;
			m_tms32025_dec_cycles += (m_RPTC+2) * CLK;

			opcode_func op_func;
			if (m_opcode.b.h == 0xCE)
				/* Do all 0xCExx Opcodes */
				op_func = s_opcode_CE_subset[m_opcode.b.l].function;
			else
				/* Do all other opcodes */
				op_func = s_opcode_main[m_opcode.b.h].function;

			(this->*op_func)();
			m_init_load_addr = 0;

			while (m_RPTC != 0) {
				(this->*op_func)();
				m_RPTC--;
			}

			m_PFC = m_PC;
			m_init_load_addr = 1;
		}

		process_timer(m_tms32025_dec_cycles);

		/**** If device is put into idle mode, exit and wait for an interrupt */
		while (m_idle && m_icount > 0)
			process_timer(m_icount);


		/**** If hold pin is active, exit if accessing external memory or if HM is set */
		if (m_hold) {
			if (is_mem_access_external() || HM) {
				if (m_icount > 0) {
					m_icount = 0;
				}
				return;
			}
		}
	}
}



/****************************************************************************
 *  Set IRQ line state
 ****************************************************************************/
void tms3202x_device::execute_set_input(int irqline, int state)
{
	if (irqline == TMS32025_FSX) {
		if (state != CLEAR_LINE && m_waiting_for_serial_frame)
		{
			m_waiting_for_serial_frame = false;
			m_IFR = 0x20;
		}
	}
	else
	{
		/* Pending IRQs cannot be cleared */
		if (state != CLEAR_LINE)
		{
			m_IFR |= (1 << irqline);
		}
	}
}
